//=====================================================================================================================
// Проект: CubeXWindows
// Раздел: Общий модуль Windows
// Подраздел: Подсистема центральных менеджеров
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXWindowManager.cs
*		Центральный менеджер основной формы приложения.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 24.05.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
using System.Windows.Input;
//---------------------------------------------------------------------------------------------------------------------
using CubeX.Core;
//=====================================================================================================================
namespace CubeX
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WindowsCommonManagers
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Центральный менеджер основной формы приложения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XWindowManager
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Исследователь модели
			/// </summary>
			public static ICubeXUIExploreModel ExploreModel;

			/// <summary>
			/// Инспектор свойств
			/// </summary>
			public static ICubeXPropertyInspector PropertyInspector;

			/// <summary>
			/// Диспетчер для управления всеми доступными репозиториями данных
			/// </summary>
			public static CRepositoryDispatcher RepositoryDispatcher;
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================