//=====================================================================================================================
// Проект: CubeXWindows
// Раздел: Модуль работы с WPF
// Подраздел: Методы расширения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXWindowsExtensionFlowDocument.cs
*		Методы расширения для работы с документами.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 24.05.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Reflection;
using System.Runtime.InteropServices;
using System.Windows;
using System.Windows.Documents;
using System.Windows.Media;
using System.Windows.Media.Imaging;
//=====================================================================================================================
namespace CubeX
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WindowsWPFExtension
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширения для типа <see cref="FlowDocument"/>
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XExtensionWindowsFlowDocument
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установить текст для указанного элемента Run
			/// </summary>
			/// <param name="@this">Документ</param>
			/// <param name="run_name">Имя элемента Run</param>
			/// <param name="text">Текст</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SetTextForRunName(this FlowDocument @this, String run_name, String text)
			{
				Run run = @this.FindName(run_name) as Run;
				if (run != null)
				{
					run.Text = text;
				}
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================