//=====================================================================================================================
// Проект: CubeXWindows
// Раздел: Модуль работы с WPF
// Подраздел: Элементы интерфейса
// Группа: Элементы для работы с репозиториями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXRepositoryViewer.xaml.cs
*		Основной элемент для просмотра доступных репозиториев.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 24.05.2020
//=====================================================================================================================
using System;
using System.Linq;
//---------------------------------------------------------------------------------------------------------------------
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
//---------------------------------------------------------------------------------------------------------------------
using CubeX.Core;
//=====================================================================================================================
namespace CubeX
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup WindowsWPFControlsRepository Элементы для работы с репозиториями
		//! \ingroup WindowsWPFControls
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Основной элемент для просмотра доступных репозиториев
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class CubeXRepositoryViewer : Window
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal CRepositoryDispatcher mRepositoryDispatcher;
			internal ListCollectionView mRepositoriesView;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Диспетчер репозиториев
			/// </summary>
			public CRepositoryDispatcher RepositoryDispatcher
			{
				get { return (mRepositoryDispatcher); }
				set 
				{
					mRepositoryDispatcher = value;
					if(mRepositoryDispatcher != null)
					{
						SetRepositoryDispatcher();
					}
				}
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CubeXRepositoryViewer()
			{
				InitializeComponent();
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка диспетчера репозиториев
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public void SetRepositoryDispatcher()
			{
				mRepositoriesView = new ListCollectionView(mRepositoryDispatcher.Repositories.Values.ToList());
				dataRepositories.ItemsSource = mRepositoriesView;
				labelCountRepositories.Content = mRepositoriesView.Count.ToString();
			}
			#endregion

			#region ======================================= ОБРАБОТЧИКИ СОБЫТИЙ =======================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Загрузка окна и готовность его к отображению
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnWindow_Loaded(Object sender, RoutedEventArgs args)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Редактирование данных
			/// </summary>
			/// <remarks>
			/// Возникает перед выходом ячейки из режима редактирования
			/// </remarks>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnDataRecords_CellEditEnding(Object sender, DataGridCellEditEndingEventArgs args)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выбор репозитория
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnButtonSelectRepository_Click(Object sender, RoutedEventArgs args)
			{
				ICubeXRepository repository = dataRepositories.SelectedItem as ICubeXRepository;
				if (repository != null)
				{
					//CubeXRepositoryDataViewer repository_data_viewer = new CubeXRepositoryDataViewer();
					//repository_data_viewer.Repository = repository;
					//repository_data_viewer.ShowDialog();
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================