//=====================================================================================================================
// Решение: CubeXPlatform
// Проект: CubeXWindows
// Раздел: Модуль пользовательского интерфейса
// Подраздел: Общие элементы управления
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXPropertyModelRange.cs
*		Модель отображения свойства объекта который имеет диапазон изменений.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 24.05.2020
//=====================================================================================================================
using System;
using System.Reflection;
//---------------------------------------------------------------------------------------------------------------------
using CubeX.Core;
//=====================================================================================================================
namespace CubeX
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WindowsWPFControlsData
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Модель отображения свойства объекта который имеет диапазон изменений
		/// </summary>
		/// <typeparam name="TNumeric">Тип значения свойства</typeparam>
		//-------------------------------------------------------------------------------------------------------------
		public class PropertyModelRange<TNumeric>: PropertyModel<TNumeric>
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal TNumeric mMinValue;
			internal TNumeric mMaxValue;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Минимальное значение
			/// </summary>
			public TNumeric MinValue
			{
				get { return (mMinValue); }
			}

			/// <summary>
			/// Максимальное значение
			/// </summary>
			public TNumeric MaxValue
			{
				get { return (mMaxValue); }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public PropertyModelRange()
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="property_info">Метаданные свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public PropertyModelRange(PropertyInfo property_info)
				: base(property_info, TPropertyType.Numeric)
			{
				GetInfoFromAttributesRange();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="property_info">Метаданные свойства</param>
			/// <param name="property_desc">Описание свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public PropertyModelRange(PropertyInfo property_info, CPropertyDesc property_desc)
				: base(property_info, property_desc, TPropertyType.Numeric)
			{
				GetInfoFromAttributesRange();
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение данных описание свойства с его атрибутов
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			protected void GetInfoFromAttributesRange()
			{
				if (mInfo != null)
				{
					CubeXMinValueAttribute min_value = mInfo.GetAttribute<CubeXMinValueAttribute>();
					if (min_value != null)
					{
						mMinValue = (TNumeric)(Object)min_value.MinValue;
					}
					else
					{
						FieldInfo field_info = typeof(TNumeric).GetField(nameof(MinValue), BindingFlags.Static | BindingFlags.Public);
						if (field_info != null)
						{
							mMinValue = (TNumeric)(Object)field_info.GetValue(null);
						}
					}

					CubeXMaxValueAttribute max_value = mInfo.GetAttribute<CubeXMaxValueAttribute>();
					if (max_value != null)
					{
						mMaxValue = (TNumeric)(Object)max_value.MaxValue;
					}
					else
					{
						FieldInfo field_info = typeof(TNumeric).GetField(nameof(MaxValue), BindingFlags.Static | BindingFlags.Public);
						if(field_info != null)
						{
							mMaxValue = (TNumeric)(Object)field_info.GetValue(null);
						}
					}
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================