//=====================================================================================================================
// Проект: CubeXWindows
// Раздел: Общий модуль Windows
// Подраздел: Подсистема нативного доступа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXWindowsNativeStruct.cs
*		Определение нативных структур данных Win32.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 24.05.2020
//=====================================================================================================================
using System;
using System.Runtime.InteropServices;
//=====================================================================================================================
namespace CubeX
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup WindowsCommonNative
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Структура для описания точки Win32
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[StructLayout(LayoutKind.Sequential)]
		public struct Win32Point
		{
			/// <summary>
			/// Координата по X
			/// </summary>
			public Int32 X;

			/// <summary>
			/// Координата по Y
			/// </summary>
			public Int32 Y;
		};

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Структура для описания размера Win32
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[StructLayout(LayoutKind.Sequential)]
		public struct Win32Size
		{
			/// <summary>
			/// Ширина
			/// </summary>
			public Int32 Width;

			/// <summary>
			/// Высота
			/// </summary>
			public Int32 Height;
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Структура для описания перемещаемой иконки
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[StructLayout(LayoutKind.Sequential)]
		public struct ShDragImage
		{
			/// <summary>
			/// Размер иконки
			/// </summary>
			public Win32Size SizeDragImage;

			/// <summary>
			/// Смещение
			/// </summary>
			public Win32Point Offset;

			/// <summary>
			/// Указатель на данные
			/// </summary>
			public IntPtr DragImage;

			/// <summary>
			/// Цветовой ключ
			/// </summary>
			public Int32 ColorKey;
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Структура для хранения информации о файле
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public struct ShellFileInfo
		{
			/// <summary>
			/// Дескриптор иконки связанный с данным типом файла
			/// </summary>
			public IntPtr IconHandle;
			
			/// <summary>
			/// Индекс иконки в списке
			/// </summary>
			public Int32 IconIndex;
			
			/// <summary>
			/// Атрибуты файла
			/// </summary>
			public UInt32 Attributes;
			
			/// <summary>
			/// Путь к файлу
			/// </summary>
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 256)]
			public String DisplayName;

			/// <summary>
			/// Имя типа файла
			/// </summary>
			[MarshalAs(UnmanagedType.ByValTStr, SizeConst = 80)]
			public String TypeName;
		};
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================